In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
url = "http://facweb.cs.depaul.edu/mobasher/classes/csc478/Data/titanic-trimmed.csv"
titanic = pd.read_csv(url)
titanic.head()

   pid pclass  survived     sex   age  sibsp  parch        fare     embarked
0    1    1st         1  female  29.0      0      0  211.337494  Southampton
1    2    1st         1    male   NaN      1      2  151.550003  Southampton
2    3    1st         0  female   2.0      1      2  151.550003  Southampton
3    4    1st         0    male  30.0      1      2  151.550003  Southampton
4    5    1st         0  female  25.0      1      2  151.550003  Southampton

In [3]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 9 columns):
pid         1309 non-null int64
pclass      1309 non-null object
survived    1309 non-null int64
sex         1309 non-null object
age         1045 non-null float64
sibsp       1309 non-null int64
parch       1309 non-null int64
fare        1308 non-null float64
embarked    1307 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 92.1+ KB

In [4]:
titanic['pclass'].isnull().sum()

0

In [5]:
titanic['survived'].isnull().sum()

0

In [6]:
titanic['age'].isnull().sum()

264

In [7]:
titanic['embarked'].isnull().sum()

2

In [8]:
titanic.loc[(titanic['embarked'].isnull())].head()

     pid pclass  survived     sex   age  sibsp  parch  fare embarked
168  169    1st         1  female  38.0      0      0  80.0      NaN
284  285    1st         1  female  62.0      0      0  80.0      NaN

In [9]:
titanic.loc[(titanic['age'].isnull())].head()

    pid pclass  survived   sex  age  sibsp  parch        fare     embarked
1     2    1st         1  male  NaN      1      2  151.550003  Southampton
15   16    1st         0  male  NaN      0      0   25.924999  Southampton
37   38    1st         1  male  NaN      0      0   26.549999  Southampton
40   41    1st         0  male  NaN      0      0   39.599998    Cherbourg
46   47    1st         0  male  NaN      0      0   31.000000  Southampton

In [10]:
titanic.loc[(titanic['age'].isnull()), 'age'] = 0

In [11]:
titanic['age'].isnull().any()

False

In [12]:
titanic.dtypes

pid           int64
pclass       object
survived      int64
sex          object
age         float64
sibsp         int64
parch         int64
fare        float64
embarked     object
dtype: object

In [13]:
titanic.shape

(1309, 9)

In [14]:
titanic[titanic.age.isnull()].shape

(0, 9)

In [15]:
titanic.head()

   pid pclass  survived     sex   age  sibsp  parch        fare     embarked
0    1    1st         1  female  29.0      0      0  211.337494  Southampton
1    2    1st         1    male   0.0      1      2  151.550003  Southampton
2    3    1st         0  female   2.0      1      2  151.550003  Southampton
3    4    1st         0    male  30.0      1      2  151.550003  Southampton
4    5    1st         0  female  25.0      1      2  151.550003  Southampton

In [16]:
titanic.set_index('pid', drop=True, inplace=True)

In [17]:
age_mean = titanic.age.mean()
titanic.age.fillna(age_mean, axis=0, inplace=True)
titanic.dropna(axis=0, inplace=True)

In [18]:
titanic.shape

(1306, 8)

In [19]:
titanic.head()

    pclass  survived     sex   age  sibsp  parch        fare     embarked
pid
1      1st         1  female  29.0      0      0  211.337494  Southampton
2      1st         1    male   0.0      1      2  151.550003  Southampton
3      1st         0  female   2.0      1      2  151.550003  Southampton
4      1st         0    male  30.0      1      2  151.550003  Southampton
5      1st         0  female  25.0      1      2  151.550003  Southampton

In [20]:
titanic['embarked'].value_counts()

Southampton    913
Cherbourg      270
Queenstown     123
Name: embarked, dtype: int64

In [21]:
titanic['pclass'].value_counts()

3rd    708
1st    321
2nd    277
Name: pclass, dtype: int64

In [22]:
titanic['survived'].value_counts()

0    808
1    498
Name: survived, dtype: int64

In [23]:
titanic['sex'].value_counts()

male      842
female    464
Name: sex, dtype: int64

In [24]:
titanic_dum = pd.get_dummies(titanic)

In [25]:
titanic_dum.head()

,survived,age,sibsp,parch,fare,pclass_1st,pclass_2nd,pclass_3rd,sex_female,sex_male,embarked_Cherbourg,embarked_Queenstown,embarked_Southampton
pid,,,,,,,,,,,,,
1,1,29.0,0,0,211.337494,1,0,0,1,0,0,0,1
2,1,0.0,1,2,151.550003,1,0,0,0,1,0,0,1
3,0,2.0,1,2,151.550003,1,0,0,1,0,0,0,1
4,0,30.0,1,2,151.550003,1,0,0,0,1,0,0,1
5,0,25.0,1,2,151.550003,1,0,0,1,0,0,0,1

In [26]:
titanic_names = titanic_dum.columns.values

In [27]:
titanic_names

array(['survived', 'age', 'sibsp', 'parch', 'fare', 'pclass_1st',
       'pclass_2nd', 'pclass_3rd', 'sex_female', 'sex_male',
       'embarked_Cherbourg', 'embarked_Queenstown', 'embarked_Southampton'], dtype=object)

In [28]:
y = titanic_dum['survived']
X = titanic_dum[titanic_names[1:]]

In [29]:
y.head()

pid
1    1
2    1
3    0
4    0
5    0
Name: survived, dtype: int64

In [30]:
X.head()

,age,sibsp,parch,fare,pclass_1st,pclass_2nd,pclass_3rd,sex_female,sex_male,embarked_Cherbourg,embarked_Queenstown,embarked_Southampton
pid,,,,,,,,,,,,
1,29.0,0,0,211.337494,1,0,0,1,0,0,0,1
2,0.0,1,2,151.550003,1,0,0,0,1,0,0,1
3,2.0,1,2,151.550003,1,0,0,1,0,0,0,1
4,30.0,1,2,151.550003,1,0,0,0,1,0,0,1
5,25.0,1,2,151.550003,1,0,0,1,0,0,0,1

In [31]:
titanic_dum.describe()

,survived,age,sibsp,parch,fare,pclass_1st,pclass_2nd,pclass_3rd,sex_female,sex_male,embarked_Cherbourg,embarked_Queenstown,embarked_Southampton
count,1306.000000,1306.000000,1306.00000,1306.000000,1306.000000,1306.000000,1306.000000,1306.000000,1306.000000,1306.000000,1306.000000,1306.000000,1306.000000
mean,0.381317,23.808767,0.50000,0.385911,33.223956,0.245789,0.212098,0.542113,0.355283,0.644717,0.206738,0.094181,0.699081
std,0.485896,17.546602,1.04258,0.866357,51.765986,0.430719,0.408950,0.498414,0.478782,0.478782,0.405121,0.292192,0.458833
min,0.000000,0.000000,0.00000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,7.000000,0.00000,0.000000,7.895800,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,0.000000,24.000000,0.00000,0.000000,14.454200,0.000000,0.000000,1.000000,0.000000,1.000000,0.000000,0.000000,1.000000
75%,1.000000,35.000000,1.00000,0.000000,31.275000,0.000000,0.000000,1.000000,1.000000,1.000000,0.000000,0.000000,1.000000
max,1.000000,80.000000,8.00000,9.000000,512.329224,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [32]:
from sklearn.cross_validation import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size = 0.2, random_state = 33)

/Users/prinklek/anaconda3/lib/python3.6/site-packages/sklearn/cross_validation.py:44: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)

In [33]:
from sklearn import tree
dt = tree.DecisionTreeClassifier(criterion='entropy')
dt = dt.fit(X_train, y_train)

In [34]:
from sklearn import feature_selection

In [35]:
fs = feature_selection.SelectPercentile(feature_selection.chi2, percentile=30)
X_train_fs = fs.fit_transform(X_train, y_train)

In [48]:
X_test_fs = fs.fit_transform(X_test, y_test)

In [36]:
np.set_printoptions(suppress=True, precision=2, linewidth=80)

In [37]:
print(fs.get_support())

[False False False  True  True False False  True  True False False False]

In [38]:
print(fs.scores_)

[    5.79     0.      22.34  5185.44    61.98     1.28    35.15   189.1    102.94
    27.57     0.01     8.16]

In [39]:
X.columns.values

array(['age', 'sibsp', 'parch', 'fare', 'pclass_1st', 'pclass_2nd',
       'pclass_3rd', 'sex_female', 'sex_male', 'embarked_Cherbourg',
       'embarked_Queenstown', 'embarked_Southampton'], dtype=object)

In [40]:
print(X.columns[fs.get_support()].values)

['fare' 'pclass_1st' 'sex_female' 'sex_male']

In [41]:
print(X_train_fs)

[[ 31.39   0.     0.     1.  ]
 [ 15.05   0.     0.     1.  ]
 [ 91.08   1.     0.     1.  ]
 ...,
 [ 21.     0.     1.     0.  ]
 [ 31.5    0.     0.     1.  ]
 [  7.9    0.     0.     1.  ]]

In [49]:
print(X_test_fs)

[[   0.      7.75    0.      1.  ]
 [  31.     52.      0.      1.  ]
 [  35.    512.33    0.      1.  ]
 ...,
 [   0.17   20.58    1.      0.  ]
 [  29.     22.02    0.      1.  ]
 [  11.     46.9     0.      1.  ]]

In [45]:
from sklearn import linear_model
lr = linear_model.LogisticRegression()

In [46]:
lr.fit(X_train_fs, y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [47]:
lr.score(X_train_fs, y_train)

0.7816091954022989

In [50]:
lr.score(X_test_fs, y_test)

0.38167938931297712

In [51]:
y_hat = lr.predict(X_train_fs)

In [52]:
y_hat

array([0, 0, 0, ..., 1, 0, 0])

In [53]:
y_hat_1 = lr.predict(X_test_fs)

In [55]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score
from sklearn.ensemble import RandomForestClassifier

In [57]:
rfc = RandomForestClassifier(n_estimators=50, max_depth=None, max_features='auto')
dtc = DecisionTreeClassifier(max_depth=None, 
                             max_features='auto')

In [60]:
dtc.fit(X_train_fs, y_train)
print('dtc acc:', dtc.score(X_test_fs, y_test))

dtc acc: 0.748091603053

In [61]:
rfc.fit(X_train_fs, y_train)
print('rfc acc:', rfc.score(X_test_fs, y_test))

rfc acc: 0.75572519084